
#Область СлужебныйПрограммныйИнтерфейс

// Обработчик регламентного задания.
Процедура ВКМ_ОтправитьСообщениеВТелеграм() Экспорт
	
	ПараметрыПодключения = ПараметрыПодключения();   
	Метод = "POST";
	АдресСайта = ПараметрыПодключения.АдресТелеграм;
	АдресБота = "/bot" + ПараметрыПодключения.ТокенБота + "/sendMessage";
	
	HTTPЗапрос = Новый HTTPЗапрос;
	HTTPЗапрос.Заголовки.Вставить("Connection", "keep-alive");
	HTTPЗапрос.Заголовки.Вставить("Content-Type", "application/json");
	HTTPЗапрос.Заголовки.Вставить(Метод + "/enter HTTP/1.1");
    HTTPЗапрос.АдресРесурса = АдресБота;
	
	Соединение = Новый HTTPСоединение(АдресСайта,,,,,30, Новый ЗащищенноеСоединениеOpenSSL());
	
	//Данные для передачи
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_Уведомления.ТекстСообщения КАК ТекстСообщения,
	               |	ВКМ_Уведомления.Ссылка КАК Ссылка
	               |ИЗ
	               |	Справочник.ВКМ_Уведомления КАК ВКМ_Уведомления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	ПереданныеСообщения = Новый Массив; 
	
	Пока Выборка.Следующий() Цикл
		
		ПараметрыHTTPЗапроса = Новый Структура;   
		ПараметрыHTTPЗапроса.Вставить("chat_id", ПараметрыПодключения.ИДГруппы);
		ПараметрыHTTPЗапроса.Вставить("parse_mode", "html");
		ПараметрыHTTPЗапроса.Вставить("text", Выборка.ТекстСообщения);
		
		СтрокаJSON = ЗаписатьЗначениеJSON(ПараметрыHTTPЗапроса);  
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, "utf-8");

		ОтветHTTP =  Соединение.ОтправитьДляОбработки(HTTPЗапрос);
		
		Попытка 	
			
			Если ОтветHTTP.КодСостояния = 200 Тогда
				ПереданныеСообщения.Добавить(Выборка.Ссылка);
			Иначе
				ЗаписатьСведенияОбОшибкеВЖурнал("Не удалось переслать сообщение", ОтветHTTP.ПолучитьТелоКакСтроку("utf-8"));
			КонецЕсли;
		Исключение
			ЗаписатьСведенияОбОшибкеВЖурнал("Нет ответа от удаленного сервера", ОписаниеОшибки());
		КонецПопытки;		
		
		
	КонецЦикла;	
	
	Соединение.Удалить(HTTPЗапрос);
	
	Для каждого Запись Из ПереданныеСообщения Цикл
		СправочникОбъект = Запись.ПолучитьОбъект();
		СправочникОбъект.Удалить();
	КонецЦикла;	
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Функция ПараметрыПодключения()
	
	Параметры = Новый Структура("АдресТелеграм, ТокенБота , ИДГруппы");
	Параметры.АдресТелеграм = "api.telegram.org";  
	Параметры.ТокенБота = СокрЛП(Константы.ВКМ_Токен.Получить()); 							
	Параметры.ИДГруппы = СокрЛП(Константы.ВКМ_ИдентификаторГруппы.Получить()); 	
	
	Возврат Параметры;	
КонецФункции

Процедура ЗаписатьСведенияОбОшибкеВЖурнал(ИмяСобытия, Комментарий)	
	СписокЗаписейЖурнала = Новый СписокЗначений();	
	ЗаписьЖурнала = Новый Структура();
	ЗаписьЖурнала.Вставить("ИмяСобытия",ИмяСобытия);
	ЗаписьЖурнала.Вставить("ПредставлениеУровня", "Ошибка"); 
	ЗаписьЖурнала.Вставить("Комментарий", Комментарий); //ОписаниеОшибки());
	ЗаписьЖурнала.Вставить("ДатаСобытия",  ТекущаяДатаСеанса());
	СписокЗаписейЖурнала.Добавить(ЗаписьЖурнала);
	ЖурналРегистрации.ЗаписатьСобытияВЖурналРегистрации(СписокЗаписейЖурнала);
КонецПроцедуры	
#КонецОбласти






