#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ОбработчикиСобытий	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ВыплатаЗарплатыВыплаты.Сотрудник КАК Сотрудник,
	               |	СУММА(ВКМ_ВыплатаЗарплатыВыплаты.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.ВКМ_ВыплатаЗарплаты.Выплаты КАК ВКМ_ВыплатаЗарплатыВыплаты
	               |ГДЕ
	               |	ВКМ_ВыплатаЗарплатыВыплаты.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_ВыплатаЗарплатыВыплаты.Сотрудник";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Пока Выборка.Следующий()  Цикл
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = Выборка.Сумма;
	КонецЦикла; 
	
КонецПроцедуры 

#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура АвтозаполнениеТабличнойЧасти() Экспорт
	
	Если Проведен Тогда  
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нельзя автоматически заполнить проведенный документ. Автозаполнение не выполнено.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;	
	
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник КАК Сотрудник,
	               |	ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток КАК Сумма
	               |ИЗ
	               |	РегистрНакопления.ВКМ_ВзаиморасчетыССотрудниками.Остатки(&Дата, ) КАК ВКМ_ВзаиморасчетыССотрудникамиОстатки
	               |ГДЕ
	               |	НЕ ВКМ_ВзаиморасчетыССотрудникамиОстатки.Сотрудник.ПометкаУдаления
	               |	И ВКМ_ВзаиморасчетыССотрудникамиОстатки.СуммаОстаток > 0";
	
	Запрос.Параметры.Вставить("Дата", ТекущаяДатаСеанса());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
    Выплаты.Очистить();
	
	Пока Выборка.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Выплаты.Добавить(), Выборка);  	
	КонецЦикла;	
	
	
КонецПроцедуры

#КонецОбласти
	
#КонецЕсли
  