 #Область ОбработчикиСобытийФормы
 
 &НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.Проведен Тогда   
		Элементы.НачисленияЗаполнить.Доступность = Ложь;
	КонецЕсли;
	

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере(Премия);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере(Премия)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ВыполнитьАвтозаполнение(Премия);	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");

КонецПроцедуры
#КонецОбласти