
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	//++Бедрышева: Работа с договорами абонентского обслуживания
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина; 
	//--Бедрышева: Работа с договорами абонентского обслуживания 
КонецПроцедуры

Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//++Бедрышева: Работа с договорами абонентского обслуживания
	// АктОбОказанииУслуг
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслуг";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
	КомандаПечати.Порядок = 5;     
	
	// Печать встроенного Word-документа (ПФ_DOC)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Документ.РеализацияТоваровУслуг.ПФ_DOC_АктОбОказанииУслугWord"; 
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг (встроенный docx)'");
	КомандаПечати.Порядок = 100;

	//--Бедрышева: Работа с договорами абонентского обслуживания
	
	
КонецПроцедуры

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//++Бедрышева: Работа с договорами абонентского обслуживания
	// АктОбОказанииУслуг

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанииУслуг");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАктаОбОказанииУслуг(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказании услуг'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанииУслуг";
	КонецЕсли; 
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_DOC_АктОбОказанииУслугWord");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ОфисныеДокументы = ПечатьАктаОбОказанииУслугWord(МассивОбъектов);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказании услуг (word)'");
	 КонецЕсли; 
	//--Бедрышева: Работа с договорами абонентского обслуживания
			
КонецПроцедуры
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

//++Бедрышева: Работа с договорами абонентского обслуживания
// Печать Акта об оказании услуг
#Область ПечатьАктаОбОказанииУслуг  

Функция ПечатьАктаОбОказанииУслуг(МассивОбъектов, ОбъектыПечати)  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОбОказанииУслуг";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанииУслуг");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);  
	
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовокАктаОбОказанииУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
					
		ВывестиТЧ(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиПодвалАктаОбОказанииУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
					
	КонецЦикла;	
		
	Возврат ТабличныйДокумент;

КонецФункции  

Функция ПолучитьДанныеДокументов(МассивОбъектов)   
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
	                |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
	                |ПОМЕСТИТЬ ВТ_ИтогиУслуги
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	                |ГДЕ
	                |	РеализацияТоваровУслугУслуги.Ссылка В(&МассивОбъектов)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровУслугУслуги.Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ВТ_ИтогиУслуги.Сумма КАК СуммаИтого,
	                |	РеализацияТоваровУслуг.Организация.Представление КАК Организация,
	                |	РеализацияТоваровУслуг.Контрагент.Представление КАК Контрагент,
	                |	РеализацияТоваровУслуг.Договор.Представление КАК Договор,
	                |	РеализацияТоваровУслуг.Услуги.(
	                |		НомерСтроки КАК НомерСтроки,
	                |		Номенклатура.Представление КАК Номенклатура,
	                |		Количество КАК Количество,
	                |		Цена КАК Цена,
	                |		Сумма КАК Сумма
	                |	) КАК Услуги,
	                |	РеализацияТоваровУслуг.Номер КАК Номер,
	                |	РеализацияТоваровУслуг.Дата КАК Дата
	                |ИЗ
	                |	ВТ_ИтогиУслуги КАК ВТ_ИтогиУслуги
	                |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                |		ПО ВТ_ИтогиУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка";
	
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
КонецФункции
   
Процедура ВывестиЗаголовокАктаОбОказанииУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ДанныеПечати = Новый Структура; 
	ДанныеПечати.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер));   
	
	ДанныеПечати.Вставить("Дата", Формат(ДанныеДокументов.Дата,"ДФ=dd.MM.yyyy"));
	ДанныеПечати.Вставить("Заказчик", ДанныеДокументов.Контрагент);
	ДанныеПечати.Вставить("Исполнитель", ДанныеДокументов.Организация);
    ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);
	
	ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);  
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
    
КонецПроцедуры  


Процедура ВывестиТЧ(ДанныеДокументов, ТабличныйДокумент, Макет) 
	
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("Шапка");   
	ТабличныйДокумент.Вывести(ОбластьШапкаТЧ); 
	
	ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	
	ВыборкаТЧ = ДанныеДокументов.Услуги.Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл   
		ОбластьСтрокаТЧ.Параметры.Заполнить(ВыборкаТЧ);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры   

 
Процедура ВывестиПодвалАктаОбОказанииУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");  
	
	ДанныеПечати = Новый Структура;	 
	Рублей = ЧислоПрописью(ДанныеДокументов.СуммаИтого, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	СуммаПрописью = СтрШаблон("Всего оказано услуг на сумму: %1", Рублей);
	
	ДанныеПечати.Вставить("ПодвалСуммаПрописью", СуммаПрописью);  
	ДанныеПечати.Вставить("СуммаИтого", ДанныеДокументов.СуммаИтого); 
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПечати);
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
КонецПроцедуры

Функция ПечатьАктаОбОказанииУслугWord(МассивОбъектов)  
	
	ОфисныеДокументы = Новый Соответствие;      
	
	Для Каждого ОбъектДляПечати Из МассивОбъектов  Цикл
		
		Идентификатор = Строка(ОбъектДляПечати.УникальныйИдентификатор());
		
		АдресДокумента  = СформироватьАктОбОказанииУслугWord(ОбъектДляПечати);
		
		ОфисныеДокументы.Вставить(АдресДокумента, Идентификатор);
	КонецЦикла;	
	
	Возврат ОфисныеДокументы;
КонецФункции  


Функция  СформироватьАктОбОказанииУслугWord(ДокументСсылка) 
	
	МакетДокумента = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_АктОбОказанииУслугWord");
	Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);
	
	//Описание областей
	ОписаниеОбластей = Новый Структура;	
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");  
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка", "Общая");
    УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТЧ", "СтрокаТаблицы");   
	УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал", "Общая");  
	
	ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК СуммаИтог
	               |ПОМЕСТИТЬ ВТ_ИтогиУслуги
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ИтогиУслуги.СуммаИтог КАК СуммаИтого,
	               |	РеализацияТоваровУслуг.Номер КАК Номер,
	               |	РеализацияТоваровУслуг.Дата КАК Дата,
	               |	РеализацияТоваровУслуг.Организация.Представление КАК Исполнитель,
	               |	РеализацияТоваровУслуг.Контрагент.Представление КАК Заказчик,
	               |	РеализацияТоваровУслуг.Договор.Представление КАК Договор,
	               |	РеализацияТоваровУслуг.Услуги.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура.Представление КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	ВТ_ИтогиУслуги КАК ВТ_ИтогиУслуги
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ВТ_ИтогиУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", ДокументСсылка);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Если РезультатЗапроса.Следующий() Тогда  
		
		СтруктураЗаголовок = Новый Структура;
		СтруктураЗаголовок.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РезультатЗапроса.Номер));
		СтруктураЗаголовок.Вставить("Дата", Формат(РезультатЗапроса.Дата, "ДФ=dd.MM.yyyy"));
		СтруктураЗаголовок.Вставить("Исполнитель", РезультатЗапроса.Исполнитель);  
		СтруктураЗаголовок.Вставить("Заказчик", РезультатЗапроса.Заказчик);
		СтруктураЗаголовок.Вставить("Основание", РезультатЗапроса.Договор);
		
		//Область Заголовок:
		ОбластьЗаголовок = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Заголовок"]);    
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, ОбластьЗаголовок, СтруктураЗаголовок);   
		
		//Область шапка таблицы: 
		ОбластьШапка = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Шапка"]);    
		УправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, ОбластьШапка);       
		
		//Область табличная часть
		Услуги = РезультатЗапроса.Услуги.Выгрузить(); 
		
		Если Услуги.Количество()<> 0 Тогда   			
			УслугиДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(Услуги);
			ОбластьСтрокаТЧ = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["СтрокаТЧ"]);    
			УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, ОбластьСтрокаТЧ, УслугиДанные);    
		КонецЕсли;
		
		//Область подвал:

		Рублей = ЧислоПрописью(РезультатЗапроса.СуммаИтого, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		СуммаПрописью = СтрШаблон("Всего оказано услуг на сумму: %1", Рублей);
        	
		СтруктураПодвал = Новый Структура;
		СтруктураПодвал.Вставить("СуммаИтого", РезультатЗапроса.СуммаИтого);  
		СтруктураПодвал.Вставить("ПодвалСуммаПрописью", СуммаПрописью);
				
		ОбластьПодвал = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Подвал"]);    
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, ОбластьПодвал, СтруктураПодвал);  	
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	
		УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
		УправлениеПечатью.ОчиститьСсылки(Макет);
	
		Возврат АдресХранилищаПечатнойФормы; 
		
	Иначе
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("В документе №%1  не заполнена табличная часть услуги", ДокументСсылка); 
		Сообщение.Сообщить();
        Возврат Неопределено;
	КонецЕсли;	
	
		
КонецФункции	

#КонецОбласти
//--Бедрышева: Работа с договорами абонентского обслуживания
  

#КонецОбласти 
#КонецЕсли