
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Вызывается для формирования списка команд создания на основании КомандыСозданияНаОсновании
// Здесь можно определить команды создания на основании, общие для большинства объектов конфигурации.
// Возвращаемое значение: 
// 			СтрокаТаблицыЗначений
//
// Параметры:
//   КомандыСозданияНаОсновании - ТаблицаЗначений - сформированные команды для вывода в подменю:
//     
//     Общие настройки:
//       * Идентификатор - Строка - идентификатор команды.
//     
//     Настройки внешнего вида:
//       * Представление - Строка   - представление команды в форме.
//       * Важность      - Строка   - группа в подменю, в которой следует вывести эту команду.
//                                    Допустимо использовать: "Важное", "Обычное" и "СмТакже".
//       * Порядок       - Число    - порядок размещения команды в подменю. Используется для настройки под конкретное
//                                    рабочее место.
//       * Картинка      - Картинка - картинка команды.
//     
//     Настройки видимости и доступности:
//       * ТипПараметра - ОписаниеТипов - типы объектов, для которых предназначена эта команда.
//       * ВидимостьВФормах    - Строка - имена форм через запятую, в которых должна отображаться команда.
//                                        Используется когда состав команд отличается для различных форм.
//       * ФункциональныеОпции - Строка - имена функциональных опций через запятую, определяющих видимость команды.
//       * УсловияВидимости    - Массив из Структура - определяет видимость команды в зависимости от контекста.
//                                        Для регистрации условий следует использовать процедуру
//                                        ПодключаемыеКоманды.ДобавитьУсловиеВидимостиКоманды().
//                                        Условия объединяются по "И".
//       * ИзменяетВыбранныеОбъекты - Булево - определяет доступность команды в ситуации,
//                                        когда у пользователя нет прав на изменение объекта.
//                                        Если Истина, то в описанной выше ситуации кнопка будет недоступна.
//                                        Необязательный. Значение по умолчанию: Ложь.
//     
//     Настройки процесса выполнения:
//       * МножественныйВыбор - Булево
//                            - Неопределено - если Истина, то команда поддерживает множественный выбор.
//             В этом случае в параметре выполнения будет передан список ссылок.
//             Необязательный. Значение по умолчанию: Ложь.
//       * РежимЗаписи - Строка - действия, связанные с записью объекта, которые выполняются перед обработчиком команды.
//             "НеЗаписывать"          - Объект не записывается, а в параметрах обработчика вместо ссылок передается
//                                       вся форма. В этом режиме рекомендуется работать напрямую с формой,
//                                       которая передается в структуре 2 параметра обработчика команды.
//             "ЗаписыватьТолькоНовые" - Записывать новые объекты.
//             "Записывать"            - Записывать новые и модифицированные объекты.
//             "Проводить"             - Проводить документы.
//             Перед записью и проведением у пользователя запрашивается подтверждение.
//             Необязательный. Значение по умолчанию: "Записывать".
//       * ТребуетсяРаботаСФайлами - Булево - если Истина, то в веб-клиенте предлагается
//             установить расширение работы с файлами.
//             Необязательный. Значение по умолчанию: Ложь.
//     
//     Настройки обработчика:
//       * Менеджер - Строка - объект, отвечающий за выполнение команды.
//       * ИмяФормы - Строка - имя формы, которую требуется получить для выполнения команды.
//             Если Обработчик не указан, то у формы вызывается метод "Открыть".
//       * ПараметрыФормы - Неопределено
//                        - ФиксированнаяСтруктура - необязательный. Параметры формы, указанной в ИмяФормы.
//       * Обработчик - Строка - описание процедуры, обрабатывающей основное действие команды.
//             Формат "<ИмяОбщегоМодуля>.<ИмяПроцедуры>" используется когда процедура размещена в общем модуле.
//             Формат "<ИмяПроцедуры>" используется в следующих случаях:
//               1) если ИмяФормы заполнено то в модуле указанной формы ожидается клиентская процедура.
//               2) если ИмяФормы не заполнено то в модуле менеджера этого объекта ожидается серверная процедура.
//       * ДополнительныеПараметры - ФиксированнаяСтруктура - необязательный. Параметры обработчика, указанного в Обработчик.
Функция ДобавитьКомандуСоздатьНаОсновании(КомандыСозданияНаОсновании) Экспорт
	
	Если ПравоДоступа("Добавление", Метаданные.Документы.РеализацияТоваровУслуг) Тогда
		
        КомандаСоздатьНаОсновании = КомандыСозданияНаОсновании.Добавить();
        КомандаСоздатьНаОсновании.Менеджер = Метаданные.Документы.РеализацияТоваровУслуг.ПолноеИмя();
        КомандаСоздатьНаОсновании.Представление = ОбщегоНазначения.ПредставлениеОбъекта(Метаданные.Документы.РеализацияТоваровУслуг);
        КомандаСоздатьНаОсновании.РежимЗаписи = "Проводить";
		
		Возврат КомандаСоздатьНаОсновании;
		
	КонецЕсли;

	Возврат Неопределено;
	
КонецФункции

//Выводит команды печати в форме (для БСП).
//Параметры:
//	НастройкиОбъекта  - Структура:
// с описанием команд печати. См. УправлениеПечатью.НастройкиПечати()
Процедура ПриОпределенииНастроекПечати(НастройкиОбъекта) Экспорт
	//++Бедрышева: Работа с договорами абонентского обслуживания
	НастройкиОбъекта.ПриДобавленииКомандПечати = Истина; 
	//--Бедрышева: Работа с договорами абонентского обслуживания 
КонецПроцедуры


//Выводит команды печати в форме (для БСП).
//Параметры:
//	КомандыПечати  - ТаблицаЗначений:
// с описанием команд печати. См. УправлениеПечатью.СоздатьКоллекциюКомандПечати()
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	//++Бедрышева: Работа с договорами абонентского обслуживания
	// АктОбОказанииУслуг
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "АктОбОказанииУслуг";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг'");
	КомандаПечати.Порядок = 5;     
	
	// Печать встроенного Word-документа (ПФ_DOC)
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Документ.РеализацияТоваровУслуг.ПФ_DOC_АктОбОказанииУслугWord"; 
	КомандаПечати.МенеджерПечати = "Документ.РеализацияТоваровУслуг";
	КомандаПечати.Представление = НСтр("ru = 'Акт об оказании услуг (встроенный docx)'");
	КомандаПечати.Порядок = 100;

	//--Бедрышева: Работа с договорами абонентского обслуживания
	
	
КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	//++Бедрышева: Работа с договорами абонентского обслуживания
	// АктОбОказанииУслуг

	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "АктОбОказанииУслуг");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ТабличныйДокумент = ПечатьАктаОбОказанииУслуг(МассивОбъектов, ОбъектыПечати);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказании услуг'");
	    ПечатнаяФорма.ПолныйПутьКМакету = "Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанииУслуг";
	КонецЕсли; 
	
	ПечатнаяФорма = УправлениеПечатью.СведенияОПечатнойФорме(КоллекцияПечатныхФорм, "ПФ_DOC_АктОбОказанииУслугWord");
	Если ПечатнаяФорма <> Неопределено Тогда
	    ПечатнаяФорма.ОфисныеДокументы = ПечатьАктаОбОказанииУслугWord(МассивОбъектов);
	    ПечатнаяФорма.СинонимМакета = НСтр("ru = 'Акт об оказании услуг (word)'");
	 КонецЕсли; 
	//--Бедрышева: Работа с договорами абонентского обслуживания
			
КонецПроцедуры
 
#КонецОбласти 

#Область СлужебныеПроцедурыИФункции   

//++Бедрышева: Работа с договорами абонентского обслуживания
// Печать Акта об оказании услуг
#Область ПечатьАктаОбОказанииУслуг  

Функция ПечатьАктаОбОказанииУслуг(МассивОбъектов, ОбъектыПечати)  
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_АктОбОказанииУслуг";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_MXL_АктОбОказанииУслуг");
	
	ДанныеДокументов = ПолучитьДанныеДокументов(МассивОбъектов);  
		
	ПервыйДокумент = Истина;
	
	Пока ДанныеДокументов.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
						
		ВывестиЗаголовокАктаОбОказанииУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
					
		ВывестиТЧ(ДанныеДокументов, ТабличныйДокумент, Макет);
		
		ВывестиПодвалАктаОбОказанииУслуг(ДанныеДокументов, ТабличныйДокумент, Макет);
					
	КонецЦикла;	
		
	Возврат ТабличныйДокумент;

КонецФункции  

Функция ПолучитьДанныеДокументов(МассивОбъектов)   
	Запрос = Новый Запрос;
	Запрос.Текст =  "ВЫБРАТЬ
	                |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК Сумма,
	                |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка
	                |ПОМЕСТИТЬ ВТ_ИтогиУслуги
	                |ИЗ
	                |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	                |ГДЕ
	                |	РеализацияТоваровУслугУслуги.Ссылка В(&МассивОбъектов)
	                |
	                |СГРУППИРОВАТЬ ПО
	                |	РеализацияТоваровУслугУслуги.Ссылка
	                |;
	                |
	                |////////////////////////////////////////////////////////////////////////////////
	                |ВЫБРАТЬ
	                |	ЕСТЬNULL(ВТ_ИтогиУслуги.Сумма, 0) КАК СуммаИтого,
	                |	РеализацияТоваровУслуг.Организация.Представление КАК Организация,
	                |	РеализацияТоваровУслуг.Контрагент.Представление КАК Контрагент,
	                |	РеализацияТоваровУслуг.Договор.Представление КАК Договор,
	                |	РеализацияТоваровУслуг.Услуги.(
	                |		НомерСтроки КАК НомерСтроки,
	                |		Номенклатура.Представление КАК Номенклатура,
	                |		Количество КАК Количество,
	                |		Цена КАК Цена,
	                |		Сумма КАК Сумма
	                |	) КАК Услуги,
	                |	РеализацияТоваровУслуг.Номер КАК Номер,
	                |	РеализацияТоваровУслуг.Дата КАК Дата
	                |ИЗ
	                |	ВТ_ИтогиУслуги КАК ВТ_ИтогиУслуги
	                |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	                |		ПО ВТ_ИтогиУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка
	                |ГДЕ
	                |	РеализацияТоваровУслуг.Ссылка В(&МассивОбъектов)";
	
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	Возврат Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
					
КонецФункции
   
Процедура ВывестиЗаголовокАктаОбОказанииУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	ДанныеПечати = Новый Структура; 
	ДанныеПечати.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(ДанныеДокументов.Номер));   
	
	ДанныеПечати.Вставить("Дата", Формат(ДанныеДокументов.Дата,"ДФ=dd.MM.yyyy"));
	ДанныеПечати.Вставить("Заказчик", ДанныеДокументов.Контрагент);
	ДанныеПечати.Вставить("Исполнитель", ДанныеДокументов.Организация);
    ДанныеПечати.Вставить("Договор", ДанныеДокументов.Договор);
	
	ОбластьЗаголовок.Параметры.Заполнить(ДанныеПечати);  
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);
    
КонецПроцедуры  


Процедура ВывестиТЧ(ДанныеДокументов, ТабличныйДокумент, Макет) 
	
	ОбластьШапкаТЧ = Макет.ПолучитьОбласть("Шапка");   
	ТабличныйДокумент.Вывести(ОбластьШапкаТЧ); 
	
	ОбластьСтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");
	
	ВыборкаТЧ = ДанныеДокументов.Услуги.Выбрать();
	
	Пока ВыборкаТЧ.Следующий() Цикл   
		ОбластьСтрокаТЧ.Параметры.Заполнить(ВыборкаТЧ);
		ТабличныйДокумент.Вывести(ОбластьСтрокаТЧ);
	КонецЦикла;
	
КонецПроцедуры   

 
Процедура ВывестиПодвалАктаОбОказанииУслуг(ДанныеДокументов, ТабличныйДокумент, Макет)
	
	ОбластьПодвал = Макет.ПолучитьОбласть("Подвал");  
	
	ДанныеПечати = Новый Структура;	 
	Рублей = ЧислоПрописью(ДанныеДокументов.СуммаИтого, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	СуммаПрописью = СтрШаблон("Всего оказано услуг на сумму: %1", Рублей);
	
	ДанныеПечати.Вставить("ПодвалСуммаПрописью", СуммаПрописью);  
	ДанныеПечати.Вставить("СуммаИтого", ДанныеДокументов.СуммаИтого); 
	
	ОбластьПодвал.Параметры.Заполнить(ДанныеПечати);
	
	ТабличныйДокумент.Вывести(ОбластьПодвал);
КонецПроцедуры


Функция ПечатьАктаОбОказанииУслугWord(МассивОбъектов)  
	ОфисныеДокументы = СформироватьАктОбОказанииУслугWord(МассивОбъектов);
	Возврат ОфисныеДокументы;
КонецФункции  


Функция  СформироватьАктОбОказанииУслугWord(МассивОбъектов) 
	
	ОфисныеДокументы = Новый Соответствие;  
		
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслугУслуги.Ссылка КАК Ссылка,
	               |	СУММА(РеализацияТоваровУслугУслуги.Сумма) КАК СуммаИтог
	               |ПОМЕСТИТЬ ВТ_ИтогиУслуги
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг.Услуги КАК РеализацияТоваровУслугУслуги
	               |ГДЕ
	               |	РеализацияТоваровУслугУслуги.Ссылка В(&МассивОбъектов)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РеализацияТоваровУслугУслуги.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ЕСТЬNULL(ВТ_ИтогиУслуги.СуммаИтог, 0) КАК СуммаИтого,
	               |	РеализацияТоваровУслуг.Номер КАК Номер,
	               |	РеализацияТоваровУслуг.Дата КАК Дата,
	               |	РеализацияТоваровУслуг.Организация.Представление КАК Исполнитель,
	               |	РеализацияТоваровУслуг.Контрагент.Представление КАК Заказчик,
	               |	РеализацияТоваровУслуг.Договор.Представление КАК Договор,
	               |	РеализацияТоваровУслуг.Услуги.(
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура.Представление КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги,
	               |	ЕСТЬNULL(ВТ_ИтогиУслуги.Ссылка, РеализацияТоваровУслуг.Ссылка) КАК Ссылка
	               |ИЗ
	               |	ВТ_ИтогиУслуги КАК ВТ_ИтогиУслуги
	               |		ПОЛНОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ВТ_ИтогиУслуги.Ссылка = РеализацияТоваровУслуг.Ссылка";
	
	Запрос.Параметры.Вставить("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить().Выбрать();
	
	Пока РезультатЗапроса.Следующий() Цикл  
		
		МакетДокумента = УправлениеПечатью.МакетПечатнойФормы("Документ.РеализацияТоваровУслуг.ПФ_DOC_АктОбОказанииУслугWord");
		Макет = УправлениеПечатью.ИнициализироватьМакетОфисногоДокумента(МакетДокумента, Неопределено);
		
		//Описание областей
		ОписаниеОбластей = Новый Структура;	
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Заголовок", "Общая");  
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Шапка", "Общая");
	    УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "СтрокаТЧ", "СтрокаТаблицы");   
		УправлениеПечатью.ДобавитьОписаниеОбласти(ОписаниеОбластей, "Подвал", "Общая");  
		
		ПечатнаяФорма = УправлениеПечатью.ИнициализироватьПечатнуюФорму(Неопределено, Неопределено, Макет);
		
		
		
		СтруктураЗаголовок = Новый Структура;
		СтруктураЗаголовок.Вставить("Номер", ПрефиксацияОбъектовКлиентСервер.НомерНаПечать(РезультатЗапроса.Номер));
		СтруктураЗаголовок.Вставить("Дата", Формат(РезультатЗапроса.Дата, "ДФ=dd.MM.yyyy"));
		СтруктураЗаголовок.Вставить("Исполнитель", РезультатЗапроса.Исполнитель);  
		СтруктураЗаголовок.Вставить("Заказчик", РезультатЗапроса.Заказчик);
		СтруктураЗаголовок.Вставить("Основание", РезультатЗапроса.Договор);
		
		//Область Заголовок:
		//@skip-check bsl-legacy-check-string-literal - строковый литерал написан верно и не содержит ошибку
		ОбластьЗаголовок = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Заголовок"]);    
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, ОбластьЗаголовок, СтруктураЗаголовок);   
		
		//Область шапка таблицы: 
		//@skip-check bsl-legacy-check-string-literal  - строковый литерал написан верно и не содержит ошибку
		ОбластьШапка = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Шапка"]);    
		УправлениеПечатью.ПрисоединитьОбласть(ПечатнаяФорма, ОбластьШапка);       
		
		//Область табличная часть
		Услуги = РезультатЗапроса.Услуги.Выгрузить(); 
		
		Если Услуги.Количество()<> 0 Тогда   			
			УслугиДанные = ОбщегоНазначения.ТаблицаЗначенийВМассив(Услуги);
			//@skip-check bsl-legacy-check-string-literal  - строковый литерал написан верно и не содержит ошибку
			ОбластьСтрокаТЧ = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["СтрокаТЧ"]);    
			УправлениеПечатью.ПрисоединитьИЗаполнитьКоллекцию(ПечатнаяФорма, ОбластьСтрокаТЧ, УслугиДанные);    
		КонецЕсли;
		
		//Область подвал:

		Рублей = ЧислоПрописью(РезультатЗапроса.СуммаИтого, "Л = ru_RU; ДП = Истина", "рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
		СуммаПрописью = СтрШаблон("Всего оказано услуг на сумму: %1", Рублей);
        	
		СтруктураПодвал = Новый Структура;
		СтруктураПодвал.Вставить("СуммаИтого", РезультатЗапроса.СуммаИтого);  
		СтруктураПодвал.Вставить("ПодвалСуммаПрописью", СуммаПрописью);
				
		//@skip-check bsl-legacy-check-string-literal  - строковый литерал написан верно и не содержит ошибку
		ОбластьПодвал = УправлениеПечатью.ОбластьМакета(Макет, ОписаниеОбластей["Подвал"]);    
		УправлениеПечатью.ПрисоединитьОбластьИЗаполнитьПараметры(ПечатнаяФорма, ОбластьПодвал, СтруктураПодвал);  	
		
		АдресХранилищаПечатнойФормы = УправлениеПечатью.СформироватьДокумент(ПечатнаяФорма);
	
		УправлениеПечатью.ОчиститьСсылки(ПечатнаяФорма);
		УправлениеПечатью.ОчиститьСсылки(Макет);
	
		Идентификатор = Строка(РезультатЗапроса.Ссылка.УникальныйИдентификатор());
		ОфисныеДокументы.Вставить(АдресХранилищаПечатнойФормы, Идентификатор); 
	КонецЦикла;	
		
	Возврат ОфисныеДокументы;		
КонецФункции	

#КонецОбласти
//--Бедрышева: Работа с договорами абонентского обслуживания
  

#КонецОбласти 
#КонецЕсли