
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение  Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
	//++Бедрышева Работа с договорами абонентского обслуживания 
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения);
	КонецЕсли;
	///--Бедрышева Работа с договорами абонентского обслуживания 
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры


Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	//++Бедрышева Работа с договорами абонентского обслуживания 
	ПроверкаРеализацийАбонентскгоОбслуживания(Отказ, Режим);
	Если НЕ ВКМ_ОбслуживаниеСервер.ВидДоговораАбонентскоеОбслуживаниеСервер(Договор) Тогда
	//--Бедрышева Работа с договорами абонентского обслуживания
		Движение = Движения.ОбработкаЗаказов.Добавить();
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Договор = Договор;
		Движение.Заказ = Основание;
		Движение.СуммаОтгрузки = СуммаДокумента;
	
	//++Бедрышева Работа с договорами абонентского обслуживания	
	КонецЕсли;	
	//--Бедрышева Работа с договорами абонентского обслуживания

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

//++Бедрышева Работа с договорами абонентского обслуживания
#Область АбонентскоеОбслуживание
Процедура ВыполнитьАвтозаполнение(ДоговорАбонента) Экспорт
	
	Товары.Очистить();
	Услуги.Очистить();	
	
	Если НЕ ЗначениеЗаполнено(ДоговорАбонента) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнен договор контрагента.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕСли;
	
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	
	Если НЕ ЗначениеЗаполнено(НоменклатураАбонентскаяПлата) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнена константа Номенклатура: абонентская плата. Невозможно заполнить документ.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;		
	
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();
	Если НЕ ЗначениеЗаполнено(НоменклатураРаботыСпециалиста) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не заполнена константа Номенклатура: работы специалиста. Невозможно заполнить документ.";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;
	
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеРаботыОбороты.КоличествоЧасовОборот, 0)) КАК КоличествоЧасов,
	|	СУММА(ЕСТЬNULL(ВКМ_ВыполненныеРаботыОбороты.СуммаКОплатеОборот, 0)) КАК СуммаКОплате,
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК АбонентскаяПлата,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействия КАК НачалоДействия,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия КАК ОкончаниеДействия
	|ИЗ
	|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеРаботы.Обороты(&НачалоПериода, &КонецПериода,,) КАК
	|			ВКМ_ВыполненныеРаботыОбороты
	|		ПО ДоговорыКонтрагентов.Ссылка = ВКМ_ВыполненныеРаботыОбороты.Договор
	|ГДЕ
	|	ДоговорыКонтрагентов.Ссылка = &Ссылка
	|СГРУППИРОВАТЬ ПО
	|	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты,
	|	ДоговорыКонтрагентов.ВКМ_НачалоДействия,
	|	ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия";
	
	Запрос.Параметры.Вставить("Ссылка", ДоговорАбонента);
	Запрос.Параметры.Вставить("НачалоПериода", НачалоМесяца(Дата));
	Запрос.Параметры.Вставить("КонецПериода", КонецМесяца(Дата));
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Выборка.Следующий() Тогда
		
		Если КонецМесяца(Выборка.ОкончаниеДействия)<= НачалоМесяца(Дата) ИЛИ
			НачалоМесяца(Выборка.НачалоДействия)>= КонецМесяца(Дата) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = СтрШаблон("Договор ""%1"" не действует на %2.(сроки действия договора с %3 по %4", ДоговорАбонента, 
					Формат(Дата,"ДФ='ММММ yyyy';"), Формат(Выборка.НачалоДействия, "ДФ=dd.MM.yyyy;"), Формат(Выборка.ОкончаниеДействия, "ДФ=dd.MM.yyyy;")  );
			Сообщение.Сообщить();
			Возврат;	
		КонецЕсли;
				
		Если Выборка.АбонентскаяПлата <> 0 Тогда
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
			НоваяСтрока.Количество = 1;
			НоваяСтрока.Цена = Выборка.АбонентскаяПлата; 
			НоваяСтрока.Сумма = Выборка.АбонентскаяПлата;			
		КонецЕсли;	
		
		Если Выборка.КоличествоЧасов <> 0  Тогда
			НоваяСтрока = Услуги.Добавить();
			НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
			НоваяСтрока.Количество = Выборка.КоличествоЧасов;
			НоваяСтрока.Цена = Выборка.СуммаКОплате/Выборка.КоличествоЧасов; 
			НоваяСтрока.Сумма = Выборка.СуммаКОплате;
		КонецЕсли;	
		
	КонецЕсли;	
	
	СуммаДокумента = Услуги.Итог("Сумма");
	Ответственный = Пользователи.ТекущийПользователь();
	Основание = ДоговорАбонента;
КонецПроцедуры	

Процедура ПроверкаРеализацийАбонентскгоОбслуживания(Отказ, Режим)
	
	Если НЕ ВКМ_ОбслуживаниеСервер.ВидДоговораАбонентскоеОбслуживаниеСервер(Договор) Тогда
		Возврат;
	КонецЕсли;
	
	Отказ = Ложь;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РеализацияТоваровУслуг.Ссылка КАК Ссылка
	               |ИЗ
	               |	Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |ГДЕ
	               |	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |	И РеализацияТоваровУслуг.Проведен
	               |	И РеализацияТоваровУслуг.Договор = &Договор
	               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода
	               |	И РеализацияТоваровУслуг.Ссылка <> &Ссылка";
	
	Запрос.Параметры.Вставить("Договор", Договор);
	Запрос.Параметры.Вставить("НачалоПериода", НачалоМесяца(Дата));
	Запрос.Параметры.Вставить("КонецПериода", КонецМесяца(Дата));   
	Запрос.Параметры.Вставить("Ссылка", Ссылка);

	Результат = Запрос.Выполнить().Выбрать();
	
	
	Пока  Результат.Следующий() Цикл   
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("За период %1 уже есть документ %2 по договору абонентского обслуживания %3", 
										Формат(Дата,"ДФ='ММММ yyyy';"), Результат.Ссылка, Договор);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЦикла;
		
КонецПроцедуры	

#КонецОбласти
//--Бедрышева Работа с договорами абонентского обслуживания

#КонецОбласти

#КонецЕсли
