
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
	
	//Заполнение по параметрам (Для заполнения из планировщика) 
	Если Объект.Ссылка.Пустая() ИЛИ Параметры.Свойство("ИзменитьСуществующийДокумент") Тогда
		Объект.Ответственный =  ЗначениеПараметра("Ответственный"); 
		Объект.ДатаПроведенияРабот =  ЗначениеПараметра("ДатаПроведенияРабот");
	    Объект.ВремяНачалаРаботПлан =  ЗначениеПараметра("ВремяНачалаРаботПлан");
		Объект.ВремяОканчанияРаботПлан =  ЗначениеПараметра("ВремяОканчанияРаботПлан");
	КонецЕсли;	
	
	
КонецПроцедуры

&НаКлиенте
Процедура ПриЗакрытии(ЗавершениеРаботы)
	Оповестить("ОбновитьКалендарьСпециалиста"); 
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);   
	
	Оповестить("ОбновитьКалендарьСпециалиста"); 

КонецПроцедуры
 
#КонецОбласти 
 
 
#Область ОбработчикиСобытийЭлементовШапкиФормы
&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ЗаполнитьИзменитьСуммуДокумента();
КонецПроцедуры
#КонецОбласти 

#Область ОбработчикиСобытийЭлементовТаблицыФормыВыполненныеРаботы
&НаКлиенте
Процедура ВыполненныеРаботыЧасыКОплатеПриИзменении(Элемент)
	ЗаполнитьИзменитьСуммуДокумента();
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
#КонецОбласти

&НаСервере
Функция ЗначениеПараметра(ИмяПараметра)   
	
	Если Параметры.Свойство(ИмяПараметра) Тогда		
		Возврат Параметры[ИмяПараметра];
	КонецЕСли;
	
	Возврат Неопределено;
	
КонецФункции	

 &НаКлиенте
Процедура ЗаполнитьИзменитьСуммуДокумента()
 	СтоимостьЧаса = ВКМ_ОбслуживаниеВызовСервера.ПолучитьСтоимостьЧасаПоДоговоруВызовСервера(Объект.Договор);
	Объект.СуммаДокумента = Объект.ВыполненныеРаботы.Итог("ЧасыКОплате")*СтоимостьЧаса;
КонецПроцедуры	


#КонецОбласти
