#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение  Тогда

#Область СлужебныйПрограммныйИнтерфейс
Функция ПолучитьТаблицуМассовоСозданныхРеализацийСервер(ЗаМесяц, Организация) Экспорт  
	
	Замедлить = Ложь; //Переменная для включения искуственного замедления  для тестирования длительных операций
	
	МассивДоговоровИРеализаций = Новый Массив;
	
	//2. Для каждого договора создаем (или изменяем) документ Реализация. Дата документа - последний день месяца
	Договоры = ЗапросДоговоровЗаМесяц(ЗаМесяц, Организация);
	
	КолвоДоговоров = Договоры.Количество(); 
	ОбработаноДоговоров = 0;
	  
	Пока Договоры.Следующий() Цикл
		ОписаниеДокумента = Новый Структура;  
		ОписаниеДокумента.Вставить("Контрагент", Договоры.Контрагент);
		ОписаниеДокумента.Вставить("Договор", Договоры.Договор);  
		ОписаниеДокумента.Вставить("Дата", КонецМесяца(ЗаМесяц));
		ОписаниеДокумента.Вставить("Организация", Организация);
		
		Если НЕ ЗначениеЗаполнено(Договоры.РеализацияСсылка) Тогда  
			//Создаем новый документ
			Комментарий = СтрШаблон("Создан обработкой ""Массовое создание актов"" %1", ТекущаяДатаСеанса());			
			ОписаниеДокумента.Вставить("Комментарий", Комментарий);			
			
			ДокументОбъект = Документы.РеализацияТоваровУслуг.СоздатьДокумент(); 
			ЗаполнитьДокументРеализация(ДокументОбъект, ОписаниеДокумента);
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение);
		Иначе  
			//Если документ уже есть перезаписываем его
			Комментарий = СтрШаблон("Изменен обработкой ""Массовое создание актов"" %1", ТекущаяДатаСеанса());
			ОписаниеДокумента.Вставить("Комментарий", Комментарий);			
			
			ДокументОбъект = Договоры.РеализацияСсылка.ПолучитьОбъект(); 
			ЗаполнитьДокументРеализация(ДокументОбъект, ОписаниеДокумента);			
			
			ДокументОбъект.Записать(РежимЗаписиДокумента.Проведение); 
        КонецЕсли;
		    
		    ОписаниеДокумента.Вставить("ДокументРеализация", ДокументОбъект.Ссылка); 
		    МассивДоговоровИРеализаций.Добавить(ОписаниеДокумента);
		
		//-- Замедление для тестирования длительной процедуры--
		Если Замедлить Тогда
			ИскусственноеЗамедление(4); //Параметр - время паузы в секундах на обработку одного  договора
		КонецЕсли;	
		//-----

		ОбработаноДоговоров = ОбработаноДоговоров +1;
		ДлительныеОперации.СообщитьПрогресс(ОбработаноДоговоров*100/КолвоДоговоров);		
	КонецЦикла;	
		
	Возврат МассивДоговоровИРеализаций;
КонецФункции	
#КонецОбласти


 #Область СлужебныеПроцедурыИФункции
 
Функция ЗапросДоговоровЗаМесяц(ЗаМесяц, Организация)  	
	Запрос = Новый Запрос;   
	Запрос.Текст = "ВЫБРАТЬ
	               |	ДоговорыКонтрагентов.Владелец КАК Контрагент,
	               |	ДоговорыКонтрагентов.Ссылка КАК Договор,
	               |	ДоговорыКонтрагентов.ВКМ_СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	               |	ДоговорыКонтрагентов.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы
	               |ПОМЕСТИТЬ ВТ_Договора
	               |ИЗ
	               |	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
	               |ГДЕ
	               |	(ДоговорыКонтрагентов.ВКМ_НачалоДействия <= &НачалоПериода
	               |				И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия >= &КонецПериода
	               |			ИЛИ ДоговорыКонтрагентов.ВКМ_НачалоДействия > &НачалоПериода
	               |				И ДоговорыКонтрагентов.ВКМ_НачалоДействия < &КонецПериода
	               |			ИЛИ ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия < &КонецПериода
	               |				И ДоговорыКонтрагентов.ВКМ_ОкончаниеДействия > &НачалоПериода)
	               |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	               |	И ДоговорыКонтрагентов.Организация = &Организация
	               |	И НЕ ДоговорыКонтрагентов.ПометкаУдаления
	               |	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Договора.Контрагент КАК Контрагент,
	               |	ВТ_Договора.Договор КАК Договор,
	               |	ВТ_Договора.СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	               |	ВТ_Договора.СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	               |	РеализацияТоваровУслуг.Ссылка КАК РеализацияСсылка
	               |ПОМЕСТИТЬ ВТ_ДоговорИРеализация
	               |ИЗ
	               |	ВТ_Договора КАК ВТ_Договора
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |		ПО ВТ_Договора.Договор = РеализацияТоваровУслуг.Договор
	               |			И (РеализацияТоваровУслуг.Дата МЕЖДУ &НачалоПериода И &КонецПериода)
	               |			И (РеализацияТоваровУслуг.Проведен)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ДоговорИРеализация.Контрагент КАК Контрагент,
	               |	ВТ_ДоговорИРеализация.Договор КАК Договор,
	               |	ВТ_ДоговорИРеализация.СуммаАбонентскойПлаты КАК СуммаАбонентскойПлаты,
	               |	ВТ_ДоговорИРеализация.СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
	               |	ЕСТЬNULL(ВТ_ДоговорИРеализация.РеализацияСсылка, ЗНАЧЕНИЕ(Документ.РеализацияТоваровУслуг.ПустаяСсылка)) КАК РеализацияСсылка,
	               |	ЕСТЬNULL(ВКМ_ВыполненныеРаботыОбороты.КоличествоЧасовОборот, 0) КАК КоличествоЧасов,
	               |	ЕСТЬNULL(ВКМ_ВыполненныеРаботыОбороты.СуммаКОплатеОборот, 0) КАК СуммаКОплате
	               |ИЗ
	               |	ВТ_ДоговорИРеализация КАК ВТ_ДоговорИРеализация
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ВКМ_ВыполненныеРаботы.Обороты(&НачалоПериода, &КонецПериода, , ) КАК ВКМ_ВыполненныеРаботыОбороты
	               |		ПО (ВКМ_ВыполненныеРаботыОбороты.Договор = ВТ_ДоговорИРеализация.Договор)";
	
	
	Запрос.Параметры.Вставить("НачалоПериода", НачалоМесяца(ЗаМесяц));
	Запрос.Параметры.Вставить("КонецПериода", КонецМесяца(ЗаМесяц));   
	Запрос.Параметры.Вставить("Организация", Организация);   
	Запрос.Параметры.Вставить("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание);
	
	
	Выборка = Запрос.Выполнить().Выбрать();	
	
	Возврат Выборка;
КонецФункции

Процедура ЗаполнитьДокументРеализация(ДокументОбъект, ОписаниеДокумента)
	
	ДокументОбъект.Заполнить(ОписаниеДокумента); 
	ДокументОбъект.ВыполнитьАвтозаполнение(ОписаниеДокумента.Договор);
	ДокументОбъект.ПроверитьЗаполнение();
	
КонецПроцедуры	

Процедура ИскусственноеЗамедление(Пауза)
	
	Для счетчик = 1 по Пауза Цикл 
		ВремяПаузы = ТекущаяДатаСеанса()+1;
		Пока ТекущаяДатаСеанса() <= ВремяПаузы Цикл
			
		КонецЦикла;	 
	КонецЦикла;	 
	   
КонецПроцедуры	

#КонецОбласти

#КонецЕсли