
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	АдресДанныхВХранилище = СокрЛП(Параметры.АдресДанныхВХранилище);   
	ДанныеДокумента = ПолучитьИзВременногоХранилища(АдресДанныхВХранилище);    
	СформироватьНаСервере(ДанныеДокумента);
КонецПроцедуры
#КонецОбласти 
 
 
#Область СлужебныеПроцедурыИФункции 
 
&НаСервере
Процедура СформироватьНаСервере(ДанныеДокумента) 
	Диаграмма.Очистить();
	
	Диаграмма.Обновление = Ложь;
	
	Диаграмма.ОбластьЗаголовка.Текст = СтрШаблон("График отпусков на %1 год", Формат(ДанныеДокумента.Год,"ДФ=yyyy"));
	Диаграмма.ОбластьЗаголовка.Шрифт = ШрифтыСтиля.КрупныйШрифтТекста;
	
	Диаграмма.АвтоОпределениеПолногоИнтервала = Ложь;	
	Диаграмма.УстановитьПолныйИнтервал(НачалоГода(ДанныеДокумента.Год), КонецГода(ДанныеДокумента.Год));
	
	Диаграмма.АвтоУстановкаТекстаСерий = Ложь;
	Диаграмма.ОтображатьЛегенду = Ложь;
	Диаграмма.ПоддержкаМасштаба	= ПоддержкаМасштабаДиаграммыГанта.ВсеДанные;
	
	Для Каждого СтрокаТЧ Из ДанныеДокумента.ОтпускаСотрудников Цикл   
		
		ТочкаСотрудник = Диаграмма.УстановитьТочку(СтрокаТЧ.Сотрудник);
		ТочкаСотрудник.Текст = Строка(СтрокаТЧ.Сотрудник); 
		СерияОтпуск = Диаграмма.УстановитьСерию("Отпуск"); 
		СерияОтпуск.Цвет = WebЦвета.ЖелтоЗеленый;
				
		Значение = Диаграмма.ПолучитьЗначение(ТочкаСотрудник, СерияОтпуск);
		ДнейОтпуска = (СтрокаТЧ.ДатаОкончания - СтрокаТЧ.ДатаНачала)/(24*60*60);
		
		Интервал = Значение.Добавить();
		Интервал.Текст =СтрШаблон(" дней %1 ", ДнейОтпуска);
		
		Интервал.Начало = СтрокаТЧ.ДатаНачала; 
		Интервал.Конец = СтрокаТЧ.ДатаОкончания; 
		
			
	КонецЦикла;	
	
	Шкала1 = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы[0];
	Шкала1.Единица = ТипЕдиницыШкалыВремени.Месяц;
	Шкала1.ЦветФона = WebЦвета.БледноМиндальный; 
	НачалоМесяца = НачалоГода(ДанныеДокумента.Год); 
		
	Для НомерМесяца = 1 по 12 Цикл 
		Если НомерМесяца = 1 Тогда 
			МеткаВремени = Шкала1.Метки.Добавить(НачалоМесяца);
			НазваниеМесяца = Формат(НачалоМесяца, "ДФ=ММMM");
			МеткаВремени.Текст = НазваниеМесяца;   
		Иначе
			НачалоМесяца = ДобавитьМесяц((ДанныеДокумента.Год), НомерМесяца-1);
			МеткаВремени = Шкала1.Метки.Добавить(НачалоМесяца);
			
			НазваниеМесяца = Формат(НачалоМесяца, "ДФ=ММMM");
			МеткаВремени.Текст = НазваниеМесяца;
			//МеткаВремени.ЦветТекста = WebЦвета.Красный;				
			МеткаВремени.ЦветЛинии = WebЦвета.Бирюзовый;  
		КонецЕсли;	
	КонецЦикла;
	
	Шкала2 = Диаграмма.ОбластьПостроения.ШкалаВремени.Элементы.Добавить();
	Шкала2.Единица = ТипЕдиницыШкалыВремени.Неделя;
	Шкала2.ЦветФона = WebЦвета.Бежевый; 
	Диаграмма.Обновление = Истина;
КонецПроцедуры	
#КонецОбласти 
      

