#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий
	
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();  
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	СформироватьДвижения(); 
	
	ПроведениеПоРегиструВзаиморасчетыССотрудниками();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
Процедура СформироватьДвижения()
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.ВидРасчета КАК ВидРасчета,
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.Размер КАК Размер,
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.ВидРасчета.СпособРасчета КАК СпособРасчета
	               |ИЗ
	               |	Документ.ВКМ_НачислениеФиксированнойПремии.Начисления КАК ВКМ_НачислениеФиксированнойПремииНачисления
	               |ГДЕ
	               |	ВКМ_НачислениеФиксированнойПремииНачисления.Ссылка = &Ссылка";
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();	
	
	
	Пока Выборка.Следующий() Цикл
		
		// регистр ВКМ_ДополнительныеНачисления
		Движения.ВКМ_ДополнительныеНачисления.Записывать = Истина;
		Если ТипЗнч(Выборка.ВидРасчета) = Тип("ПланВидовРасчетаСсылка.ВКМ_ДополнительныеНачисления") Тогда	
			
			Движение = Движения.ВКМ_ДополнительныеНачисления.Добавить(); 
			Если Выборка.СпособРасчета = Перечисления.ВКМ_СпособРасчета.ФиксированнаяСумма Тогда
				
				Движение.Сторно = Ложь;
				Движение.ВидРасчета = Выборка.ВидРасчета;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = Выборка.Сотрудник;
				Движение.Размер = Выборка.Размер;
				движение.Результат = Выборка.Размер; 
				
				//Сразу добавим удержание НДФЛ  
				ПроцентНДФЛ = 13;
				Движение = Движения.ВКМ_Удержания.Добавить();
				Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
				Движение.ПериодРегистрации = Дата;
				Движение.Сотрудник = Выборка.Сотрудник;
				Движение.Размер = Выборка.Размер; 
				Движение.ВидРасчетаБаза = Выборка.ВидРасчета; 
				Движение.Результат = Движение.Размер*ПроцентНДФЛ/100;
			КонецЕсли;	 
			
		КонецЕсли;

			
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать();
	Движения.ВКМ_ДополнительныеНачисления.Записать();
КонецПроцедуры


Процедура ПроведениеПоРегиструВзаиморасчетыССотрудниками() 
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ДополнительныеНачисления.Сотрудник КАК Сотрудник,
	               |	ВКМ_ДополнительныеНачисления.Результат КАК Начислено
	               |ПОМЕСТИТЬ ВТ_Начисления
	               |ИЗ
	               |	РегистрРасчета.ВКМ_ДополнительныеНачисления КАК ВКМ_ДополнительныеНачисления
	               |ГДЕ
	               |	ВКМ_ДополнительныеНачисления.Регистратор = &Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВКМ_Удержания.Сотрудник КАК Сотрудник,
	               |	ВКМ_Удержания.Результат КАК Удержано
	               |ПОМЕСТИТЬ ВТ_Удержено
	               |ИЗ
	               |	РегистрРасчета.ВКМ_Удержания КАК ВКМ_Удержания
	               |ГДЕ
	               |	ВКМ_Удержания.Регистратор = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВКМ_Удержания.Сотрудник,
	               |	ВКМ_Удержания.Результат
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_Начисления.Сотрудник КАК Сотрудник,
	               |	СУММА(ВТ_Начисления.Начислено) КАК Начислено,
	               |	СУММА(ВТ_Удержено.Удержано) КАК Удержано
	               |ИЗ
	               |	ВТ_Начисления КАК ВТ_Начисления
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_Удержено КАК ВТ_Удержено
	               |		ПО ВТ_Начисления.Сотрудник = ВТ_Удержено.Сотрудник
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ВТ_Начисления.Сотрудник";
	
	
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	
	Пока  Выборка.Следующий() Цикл 
		 Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.ДобавитьПриход();
		 Движение.Период = Дата;
		 Движение.Сотрудник = Выборка.Сотрудник;
		 Движение.Сумма = Выборка.Начислено - Выборка.Удержано;  
	 КонецЦикла;	

	
	
КонецПроцедуры	

Процедура ВыполнитьАвтозаполнение(Премия)  Экспорт 
	
	Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВКМ_ФизическиеЛица.Ссылка КАК Сотрудник
	               |ИЗ
	               |	Справочник.ВКМ_ФизическиеЛица КАК ВКМ_ФизическиеЛица
	               |ГДЕ
	               |	НЕ ВКМ_ФизическиеЛица.ПометкаУдаления";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл     
		НоваяСтрока = Начисления.Добавить();
		НоваяСтрока.Сотрудник = Выборка.Сотрудник;
		НоваяСтрока.ВидРасчета = ПланыВидовРасчета.ВКМ_ДополнительныеНачисления.ФиксированнаяПремия; 
		НоваяСтрока.Размер = Премия;
	КонецЦикла;	
	
КонецПроцедуры	
#КонецОбласти


#КонецЕсли