#Область СлужебныйПрограммныйИнтерфейс
Функция ПолучитьСтоимостьЧасаПоДоговоруВызовСервера(Договор) Экспорт
	Возврат ВКМ_ОбслуживаниеСервер.ПолучитьСтоимостьЧасаПоДоговоруСервер(Договор);
КонецФункции	

Функция ВидДоговораАбонентскоеОбслуживаниеВызовСервера(Договор) Экспорт
	Возврат  ВКМ_ОбслуживаниеСервер.ВидДоговораАбонентскоеОбслуживаниеСервер(Договор);
КонецФункции  


//Функция ПолучитьТаблицуМассовоСозданныхРеализацийВызовСервера(Дата, Организация)  Экспорт
//	ЗаМесяц = НачалоМесяца(Дата);	
//	Возврат ВКМ_ОбслуживаниеСервер.ПолучитьТаблицуМассовоСозданныхРеализацийСервер(ЗаМесяц, Организация); 	
//КонецФункции	
#КонецОбласти