#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//++ Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);	
	//-- Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
КонецПроцедуры


&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//++ Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда		
		УстановитьВидимостьПолейДляАбонентскогоОбслуживания(Истина);
	Иначе
		УстановитьВидимостьПолейДляАбонентскогоОбслуживания(Ложь);
	КонецЕсли;		
	//-- Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
КонецПроцедуры
#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	//++ Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
	Если Объект.ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда		
		УстановитьВидимостьПолейДляАбонентскогоОбслуживания(Истина);
	Иначе
		УстановитьВидимостьПолейДляАбонентскогоОбслуживания(Ложь);
		Объект.ВКМ_НачалоДействия = "";
		Объект.ВКМ_ОкончаниеДействия = "";
		Объект.ВКМ_СтоимостьЧасаРаботы = 0;
		Объект.ВКМ_СуммаАбонентскойПлаты = 0;
	КонецЕсли;		
	//-- Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
		
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
//++ Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
Процедура УстановитьВидимостьПолейДляАбонентскогоОбслуживания(ФлагВидимости)
	Если НЕ Элементы.Найти("ВКМ_ДатаНачала") = Неопределено Тогда
		Элементы.ВКМ_ДатаНачала.Видимость = ФлагВидимости;
	КонецЕСли;	
	
	Если НЕ Элементы.Найти("ВКМ_ДатаОкончания") = Неопределено Тогда
		Элементы.ВКМ_ДатаОкончания.Видимость = ФлагВидимости;
	КонецЕСли;
	
	Если НЕ Элементы.Найти("ВКМ_СуммаАбонентскойПлаты") = Неопределено Тогда
		Элементы.ВКМ_СуммаАбонентскойПлаты.Видимость = ФлагВидимости;
	КонецЕСли;
	
	Если НЕ Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
		Элементы.ВКМ_СтоимостьЧасаРаботы.Видимость = ФлагВидимости;
	КонецЕСли;
КонецПроцедуры	
//-- Бедрышева Н.В. Задача "Абонентское обслуживание" 08.06.2025
#КонецОбласти