#Область СлужебныйПрограммныйИнтерфейс

// Выводит дополнительные поля в форме.
// Для вызова из общего модуля ПодключаемыКоманды.ПриСозданииНаСервере() 
// для формы элемента справочника ДоговорыКонтрагентов.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить поля ввода.
Процедура ВывестиДополнительныеПоляАбонентскогоДоговора(Форма) Экспорт
		
	Если Форма.Элементы.Найти("ВКМ_ГруппаПараметрыАбонентскогоДоговора") = Неопределено Тогда
		НоваяГруппа = Форма.Элементы.Добавить("ВКМ_ГруппаПараметрыАбонентскогоДоговора", Тип("ГруппаФормы"));
		НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
		НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
		НоваяГруппа.ОтображатьЗаголовок = Ложь;  
		НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная; 
		
		Если Форма.Элементы.Найти("ВКМ_ГруппаДаты") = Неопределено Тогда
			НоваяГруппа = Форма.Элементы.Добавить("ВКМ_ГруппаДаты", Тип("ГруппаФормы"), Форма.Элементы.ВКМ_ГруппаПараметрыАбонентскогоДоговора);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;  
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда; 
			
			НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_ДатаНачала", Тип("ПолеФормы"), Форма.Элементы.ВКМ_ГруппаДаты);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоДействия"; 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Действует с";  
			НовыйЭлемент.Видимость = Ложь;
			
			НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_ДатаОкончания", Тип("ПолеФормы"), Форма.Элементы.ВКМ_ГруппаДаты);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействия"; 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "по";  
			НовыйЭлемент.Видимость = Ложь;		
		КонецЕсли;
		
		Если Форма.Элементы.Найти("ВКМ_ГруппаСуммы") = Неопределено Тогда
			НоваяГруппа = Форма.Элементы.Добавить("ВКМ_ГруппаСуммы", Тип("ГруппаФормы"), Форма.Элементы.ВКМ_ГруппаПараметрыАбонентскогоДоговора);
			НоваяГруппа.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			НоваяГруппа.Отображение = ОтображениеОбычнойГруппы.Нет;
			НоваяГруппа.ОтображатьЗаголовок = Ложь;  
			НоваяГруппа.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
			
			НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_СуммаАбонентскойПлаты", Тип("ПолеФормы"), Форма.Элементы.ВКМ_ГруппаСуммы);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты"; 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Абонен. плата";  
			НовыйЭлемент.Видимость = Ложь;
			
			НовыйЭлемент = Форма.Элементы.Добавить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Форма.Элементы.ВКМ_ГруппаСуммы);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы"; 
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;
			НовыйЭлемент.Заголовок = "Стоимость часа";  
			НовыйЭлемент.Видимость = Ложь;	
		КонецЕсли;	
				
	КонецЕсли;
		
КонецПроцедуры	

// Выводит кнопку "Запонить"  в форме.
// Для вызова из общего модуля ПодключаемыКоманды.ПриСозданииНаСервере() 
// для формы документа РеализацияТоваровИУслуг.
//
// Параметры:
//   Форма - ФормаКлиентскогоПриложения - форма, в которой необходимо разместить кнопку.
Процедура ВывестиКнопкуЗаполнитьПоДоговоруАбонентскогоОбслуживания(Форма) Экспорт
	
	Если Форма.Элементы.Найти("КнопкаЗаполнитьПоАбонентскомуДоговору") = Неопределено Тогда
		НоваяКоманда = Форма.Команды.Добавить("ЗаполнитьПоДоговоруАбонентскогоОбслуживания");
		НоваяКоманда.Заголовок = "Заполнить";
		НоваяКоманда.Действие = "ЗаполнитьПоДоговоруАбонентскогоОбслуживания";   
		НоваяКоманда.Отображение = ОтображениеКнопки.КартинкаИТекст;
		НоваяКоманда.Картинка = БиблиотекаКартинок.Обновить;
		
		НовыйЭлемент = Форма.Элементы.Добавить("КнопкаЗаполнитьПоДоговоруАбонентскогоОбслуживания", Тип("КнопкаФормы"), Форма.Элементы.УслугиКоманднаяПанель);
		НовыйЭлемент.ИмяКоманды = "ЗаполнитьПоДоговоруАбонентскогоОбслуживания";
		НовыйЭлемент.Вид = ВидКнопкиФормы.ОбычнаяКнопка;
		НовыйЭлемент.ПоложениеВКоманднойПанели = ПоложениеКнопкиВКоманднойПанели.ВКоманднойПанели;
	КонецЕсли;	
	
КонецПроцедуры	
	
#КонецОбласти