
  
#Область ОбработчикиКомандФормы
 
&НаКлиенте
Процедура СоздатьАкты(Команда)
	
	ДлительнаяОперация = СоздатьАктыНаСервере();   
	
	ОповещениеОПрогрессе = Новый ОписаниеОповещения("ОповещениеОПрогрессе", ЭтотОбъект);

	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ПараметрыОжидания.Интервал = 1;   
	ПараметрыОжидания.ВыводитьОкноОжидания = Ложь;
	ПараметрыОжидания.ОповещениеОПрогрессеВыполнения  = ОповещениеОПрогрессе;
	ПараметрыОжидания.ВыводитьПрогрессВыполнения = Истина;
	
	ОповещениеОЗавершении = Новый ОписаниеОповещения("ОповещениеОЗавершении", ЭтотОбъект);     
		
	ДлительныеОперацииКлиент.ОжидатьЗавершение(ДлительнаяОперация, ОповещениеОЗавершении, ПараметрыОжидания);  
	
КонецПроцедуры    

#КонецОбласти


#Область СлужебныеПроцедурыИФункции
 
&НаСервере
Функция СоздатьАктыНаСервере()  
	
	ДлительнаяОперация = ДлительныеОперации.ВыполнитьФункцию(УникальныйИдентификатор, 
			"Обработки.ВКМ_МассовоеСозданиеАктов.ПолучитьТаблицуМассовоСозданныхРеализацийСервер", НачалоМесяца(Период.ДатаНачала), Организация);
	
	Возврат ДлительнаяОперация;

КонецФункции


&НаКлиенте
Процедура ОповещениеОЗавершении(Результат, ДополнительныеПараметры)  Экспорт
	
	Если Результат.Статус = "Выполнено" Тогда
		ДоговораИРеализации = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
		
		Для Каждого СтрокаТЧ Из ДоговораИРеализации Цикл 
			НоваяСтрока = СписокДоговоровИДокументов.Добавить();
			ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ); 			
		КонецЦикла;	
	КонецЕсли;	
	
КонецПроцедуры	

&НаКлиенте
Процедура ОповещениеОПрогрессе(Прогресс, ДополнительныеПараметры)  Экспорт
	
	Если Прогресс.Прогресс <> Неопределено Тогда
		Состояние("Выполнеятся создание актов об оказанных услуга по абонентским договорам ", Прогресс.Прогресс.Процент); 		
	КонецЕсли;	
	
КонецПроцедуры	

#КонецОбласти	
