
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	Если ТекущийОбъект.Проведен Тогда   
		Элементы.НачисленияКоманднаяПанель.ПодчиненныеЭлементы.НачисленияЗаполнить.Доступность = Ложь;
	КонецЕсли;
	

КонецПроцедуры
#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	ЗаполнитьНаСервере();
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьНаСервере()
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	ДокументОбъект.ВыполнитьАвтозаполнение(Объект.Дата);	
	ЗначениеВРеквизитФормы(ДокументОбъект, "Объект");
КонецПроцедуры
#КонецОбласти

